/**
 * \file mrp_reg_data.h
 * \author Sckom
 * \brief Заголовочный файл с объявлением структур данных и функций для работы 
 * с регистрами, данные которых считывать и записывать в энергонезавиимую 
 * память микроконтроллеров Espressif ESP32
 * \version 0.1
 * \date 2025-04-23
 * 
 * \copyright Copyright (c) 2025
 * 
 */

#ifndef MRP_REG_DATA_H
#define MRP_REG_DATA_H

/* Подключение заголовочного файла с приватными функциями (привязвны к 
используемому фреймворку и микроконтроллеру) */
#include "mrp_reg_pr.h"
// Перечень используемых пинов, необходимо хранить в ${workspaceFolder}/include
#include <mrp_cfg.h>

// Указываем количество байтов, к которым будет открыт доступ чтения/записи 
#define EEPROM_SIZE 30 // Максимальное значение 512 (по рекомендации)

// Максимальное количестов символов для названия регистра
#define MAX_LEGHT_REG_NAME 50

/*
    ===============================
    NAME REG_ZONE   ||      NUM REG
    ===============================
    WHEEL_1         ||      <0:5>
    -------------------------------
    WHEEL_2         ||      <6:11>
    -------------------------------
    WHEEL_3         ||      <12:17>
    -------------------------------
    WHEEL_4         ||      <18:23>
    -------------------------------
    CTR_MOVE        ||      <24:29>
    -------------------------------
    

    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_1         ||      <0:5>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_1_L_PWM      ||      <0>
    -------------------------------
    WH_1_R_PWM      ||      <1>
    -------------------------------
    WH_1_L_EN       ||      <2>
    -------------------------------
    WH_1_R_EN       ||      <3>
    -------------------------------
    WH_1_L_IS       ||      <4>
    -------------------------------
    WH_1_R_IS       ||      <5>
    -------------------------------


    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_2         ||      <6:11>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_2_L_PWM      ||      <6>
    -------------------------------
    WH_2_R_PWM      ||      <7>
    -------------------------------
    WH_2_L_EN       ||      <8>
    -------------------------------
    WH_2_R_EN       ||      <9>
    -------------------------------
    WH_2_L_IS       ||      <10>
    -------------------------------
    WH_2_R_IS       ||      <11>
    -------------------------------


    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_3         ||      <12:17>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_3_L_PWM      ||      <12>
    -------------------------------
    WH_3_R_PWM      ||      <13>
    -------------------------------
    WH_3_L_EN       ||      <14>
    -------------------------------
    WH_3_R_EN       ||      <15>
    -------------------------------
    WH_3_L_IS       ||      <16>
    -------------------------------
    WH_3_R_IS       ||      <17>
    -------------------------------


    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_4         ||      <18:23>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_4_L_PWM      ||      <18>
    -------------------------------
    WH_4_R_PWM      ||      <19>
    -------------------------------
    WH_4_L_EN       ||      <20>
    -------------------------------
    WH_4_R_EN       ||      <21>
    -------------------------------
    WH_4_L_IS       ||      <22>
    -------------------------------
    WH_4_R_IS       ||      <23>
    -------------------------------


    ===============================
        BREIF REG_ZONE DATA
    ===============================
    CTR_MOVE        ||      <24:29>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    CTR_PID_P       ||      <24>
    -------------------------------
    CTR_PID_I_1     ||      <25>
    -------------------------------
    CTR_PID_I_2     ||      <26>
    -------------------------------
    CTR_PID_D_1     ||      <27>
    -------------------------------
    CTR_PID_I_2     ||      <28>
    -------------------------------
    RAD_MOVE        ||      <29>
    -------------------------------
*/

// Возвращает название переменной <x> типа char[]
#define NAME_DFN(x) (#x)

/**
 * \brief Перечисление статус-кодов выполнения функций управления данными 
 * регистров
 */
typedef enum
{
    REG_ERROR_OK,
    REG_ERROR_WRONG_VAL,
    REG_ERROR_NULL_PTR,
} REG_ERROR;

/**
 * \brief Структура данных о регистре: наименование, адрес памяти, значение
 */
typedef struct
{
    char name[MAX_LEGHT_REG_NAME];
    uint8_t addr;
    byte val;
} reg_key;

#endif