/**
 * @file mrp_reg_data.h
 * @author Sckom
 * @brief 
 * @version 0.1
 * @date 2025-04-23
 * 
 * @copyright Copyright (c) 2025
 * 
 */

#ifndef MRP_REG_DATA_H
#define MRP_REG_DATA_H

#include <Arduino.h>
// Энергонезависимая память
#include <EEPROM.h>

// Указываем количество байтов, к которым будет открыт доступ чтения/записи 
#define EEPROM_SIZE 30 // Максимальное значение 512 (по рекомендации)

/*
    ===============================
    NAME REG_ZONE   ||      NUM REG
    ===============================
    WHEEL_1         ||      <0:5>
    -------------------------------
    WHEEL_2         ||      <6:11>
    -------------------------------
    WHEEL_3         ||      <12:17>
    -------------------------------
    WHEEL_4         ||      <18:23>
    -------------------------------
    CTR_MOVE        ||      <24:29>
    -------------------------------
    

    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_1         ||      <0:5>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_1_L_PWM      ||      <0>
    -------------------------------
    WH_1_R_PWM      ||      <1>
    -------------------------------
    WH_1_L_EN       ||      <2>
    -------------------------------
    WH_1_R_EN       ||      <3>
    -------------------------------
    WH_1_L_IS       ||      <4>
    -------------------------------
    WH_1_R_IS       ||      <5>
    -------------------------------


    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_2         ||      <6:11>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_2_L_PWM      ||      <6>
    -------------------------------
    WH_2_R_PWM      ||      <7>
    -------------------------------
    WH_2_L_EN       ||      <8>
    -------------------------------
    WH_2_R_EN       ||      <9>
    -------------------------------
    WH_2_L_IS       ||      <10>
    -------------------------------
    WH_2_R_IS       ||      <11>
    -------------------------------


    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_3         ||      <12:17>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_3_L_PWM      ||      <12>
    -------------------------------
    WH_3_R_PWM      ||      <13>
    -------------------------------
    WH_3_L_EN       ||      <14>
    -------------------------------
    WH_3_R_EN       ||      <15>
    -------------------------------
    WH_3_L_IS       ||      <16>
    -------------------------------
    WH_3_R_IS       ||      <17>
    -------------------------------

    ===============================
        BREIF REG_ZONE DATA
    ===============================
    WHEEL_4         ||      <18:23>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    WH_4_L_PWM      ||      <18>
    -------------------------------
    WH_4_R_PWM      ||      <19>
    -------------------------------
    WH_4_L_EN       ||      <20>
    -------------------------------
    WH_4_R_EN       ||      <21>
    -------------------------------
    WH_4_L_IS       ||      <22>
    -------------------------------
    WH_4_R_IS       ||      <23>
    -------------------------------

     ===============================
        BREIF REG_ZONE DATA
    ===============================
    CTR_MOVE        ||      <24:29>
    ===============================
        DATA_NAME   ||  NUM_REG
    ===============================
    CTR_PID_P       ||      <24>
    -------------------------------
    CTR_PID_I_1     ||      <25>
    -------------------------------
    CTR_PID_I_2     ||      <26>
    -------------------------------
    CTR_PID_D_1     ||      <27>
    -------------------------------
    CTR_PID_I_2     ||      <28>
    -------------------------------
    RAD_MOVE        ||      <29>
    -------------------------------
*/

/**
 * @brief 
 * 
 */
typedef enum
{
    REG_ERROR_OK,
    REG_ERROR_WRONG_VAL,
} REG_ERROR;

/**
 * @brief 
 * 
 */
typedef struct
{
    byte reg_f_pwm;
    byte reg_b_pwm;
    byte reg_f_en;
    byte reg_b_en;
    byte reg_f_is;
    byte reg_b_is;
} reg_data_wheel;

/**
 * @brief 
 * 
 */
typedef struct
{
    byte reg_pid_p;
    byte reg_pid_i_1;
    byte reg_pid_i_2;
    byte reg_pid_d_1;
    byte reg_pid_d_2;
    byte reg_move_rad;
} reg_data_ctr;

/**
 * @brief 
 * 
 */
typedef struct
{
    reg_data_wheel* fl_wheel;
    reg_data_wheel* fr_wheel;
    reg_data_wheel* bl_wheel;
    reg_data_wheel* br_wheel;
    reg_data_ctr* ctr_move;
} reg_data;

/**
 * @brief 
 * 
 * @return REG_ERROR 
 */
REG_ERROR reg_init(reg_data* regs);

/**
 * @brief 
 * 
 * @param regs 
 * @return REG_ERROR 
 */
REG_ERROR reg_read(reg_data* regs);

/**
 * @brief 
 * 
 * @param regs 
 * @return REG_ERROR 
 */
REG_ERROR reg_write(reg_data* regs);

#endif